Repository: marioce75/vancomyzer_website
Catalog: vancomyzer/Localizable_*.strings
Languages: ar, es

# app_name
source: Vancomyzer
ar: فانكومايزر

# app_tagline
source: Evidence-Based Vancomycin Dosing
ar: جرعات الفانكومايسين المبنية على الأدلة
es: Dosificación de Vancomicina Basada en Evidencia

# tab_initial_dosing
source: Initial Dosing
ar: الجرعة الأولية
es: Dosis Inicial

# tab_bayesian
source: Bayesian
ar: بايزي
es: Bayesiano

# tab_guidelines
source: Guidelines
ar: الإرشادات
es: Guías

# tab_history
source: History
ar: التاريخ
es: Historial

# tab_about
source: About
ar: حول
es: Acerca de

# onboarding_welcome_title
source: Welcome to Vancomyzer
ar: مرحباً بك في فانكومايزر
es: Bienvenido a Vancomyzer

# onboarding_welcome_subtitle
source: Evidence-based vancomycin dosing for healthcare professionals
ar: جرعات الفانكومايسين المبنية على الأدلة للمهنيين الصحيين
es: Dosificación de vancomicina basada en evidencia para profesionales de la salud

# onboarding_features_title
source: Powerful Features
ar: ميزات قوية
es: Características Poderosas

# onboarding_features_subtitle
source: Everything you need for optimal vancomycin dosing
ar: كل ما تحتاجه لجرعات الفانكومايسين المثلى
es: Todo lo que necesitas para una dosificación óptima de vancomicina

# onboarding_setup_title
source: Personalize Your Experience
ar: خصص تجربتك
es: Personaliza Tu Experiencia

# onboarding_setup_subtitle
source: Configure language, theme, and preferences
ar: اضبط اللغة والمظهر والتفضيلات
es: Configura idioma, tema y preferencias

# onboarding_get_started
source: Get Started
ar: ابدأ
es: Comenzar

# onboarding_continue
source: Continue
ar: متابعة
es: Continuar

# onboarding_skip
source: Skip
ar: تخطي
es: Omitir

source: Patient Information
ar: معلومات المريض
es: Información del Paciente

source: Population Type
ar: نوع السكان
es: Tipo de Población

source: Age
ar: العمر
es: Edad

source: Weight
ar: الوزن
es: Peso

source: Height
ar: الطول
es: Altura

source: Gender
ar: الجنس
es: Género

source: Serum Creatinine
ar: الكرياتينين في المصل
es: Creatinina Sérica

source: Indication
ar: المؤشر
es: Indicación

source: Severity
ar: الشدة
es: Severidad

source: CrCl Method
ar: طريقة CrCl
es: Método CrCl

# population_adult
source: Adult
ar: بالغ
es: Adulto

# population_pediatric
source: Pediatric
ar: أطفال
es: Pediátrico

# population_neonate
source: Neonate
ar: حديث الولادة
es: Neonato

# gender_male
source: Male
ar: ذكر
es: Masculino

# gender_female
source: Female
ar: أنثى
es: Femenino

# indication_pneumonia
source: Pneumonia
ar: التهاب الرئة
es: Neumonía

# indication_bacteremia
source: Bacteremia
ar: تجرثم الدم
es: Bacteriemia

# indication_endocarditis
source: Endocarditis
ar: التهاب الشغاف

# indication_meningitis
source: Meningitis
ar: التهاب السحايا

# indication_skin_soft_tissue
source: Skin & Soft Tissue
ar: الجلد والأنسجة الرخوة
es: Piel y Tejidos Blandos

# indication_bone_joint
source: Bone & Joint
ar: العظام والمفاصل
es: Hueso y Articulación

# indication_other
source: Other
ar: أخرى
es: Otro

# severity_mild
source: Mild
ar: خفيف
es: Leve

# severity_moderate
source: Moderate
ar: متوسط
es: Moderada

# severity_severe
source: Severe
ar: شديد
es: Severa

# crcl_ibw
source: Ideal Body Weight
ar: وزن الجسم المثالي
es: Peso Corporal Ideal

# crcl_tbw
source: Total Body Weight
ar: وزن الجسم الكلي
es: Peso Corporal Total

# crcl_adjbw
source: Adjusted Body Weight
ar: وزن الجسم المعدل
es: Peso Corporal Ajustado

source: Dosing Recommendation
ar: توصية الجرعة
es: Recomendación de Dosificación

source: Loading Dose
ar: جرعة التحميل
es: Dosis de Carga

source: Maintenance Dose
ar: جرعة الصيانة
es: Dosis de Mantenimiento

# predicted_auc
source: Predicted AUC₀₋₂₄
ar: AUC₀₋₂₄ المتوقع
es: AUC₀₋₂₄ Predicha

source: Predicted Trough
ar: القاع المتوقع
es: Valle Predicho

source: Predicted Peak
ar: الذروة المتوقعة
es: Pico Predicho

source: Pharmacokinetic Parameters
ar: المعاملات الدوائية الحركية
es: Parámetros Farmacocinéticos

source: Clearance
ar: التصفية
es: Aclaramiento

# volume_distribution
source: Volume of Distribution
ar: حجم التوزيع
es: Volumen de Distribución

source: Half-life
ar: نصف العمر
es: Vida Media

source: Elimination Rate
ar: معدل الإزالة
es: Tasa de Eliminación

source: Bayesian Optimization
ar: التحسين البايزي
es: Optimización Bayesiana

source: Vancomycin Levels
ar: مستويات الفانكومايسين
es: Niveles de Vancomicina

source: Add Level
ar: إضافة مستوى
es: Agregar Nivel

source: Level Value
ar: قيمة المستوى
es: Valor del Nivel

source: Time After Dose
ar: الوقت بعد الجرعة
es: Tiempo Después de la Dosis

source: Dose Number
ar: رقم الجرعة
es: Número de Dosis

source: Optimize Dosing
ar: تحسين الجرعة
es: Optimizar Dosificación

source: MAP Estimation
ar: تقدير MAP
es: Estimación MAP

# confidence_intervals
source: 95% Confidence Intervals
ar: فترات الثقة 95%
es: Intervalos de Confianza del 95%

source: Clinical Guidance
ar: الإرشاد السريري
es: Guía Clínica

source: Target Achievement
ar: تحقيق الهدف
es: Logro del Objetivo

source: Dosing Rationale
ar: مبرر الجرعة
es: Justificación de la Dosificación

source: Special Considerations
ar: اعتبارات خاصة
es: Consideraciones Especiales

source: Monitoring Recommendations
ar: توصيات المراقبة
es: Recomendaciones de Monitoreo

# level_monitoring
source: Vancomycin Level Monitoring
ar: مراقبة مستوى الفانكومايسين
es: Monitoreo de Niveles de Vancomicina

source: Safety Monitoring
ar: مراقبة السلامة
es: Monitoreo de Seguridad

# follow_up
source: Follow-up Recommendations
ar: توصيات المتابعة
es: Recomendaciones de Seguimiento

# warning_high_dose
source: High dose - monitor for toxicity
ar: جرعة عالية - راقب السمية
es: Dosis alta - monitorear toxicidad

# warning_low_clearance
source: Low clearance - consider dose reduction
ar: تصفية منخفضة - فكر في تقليل الجرعة
es: Aclaramiento bajo - considerar reducción de dosis

# warning_renal_impairment
source: Renal impairment detected
ar: تم اكتشاف ضعف كلوي
es: Deterioro renal detectado

# warning_elderly_patient
source: Elderly patient - increased monitoring recommended
ar: مريض مسن - يُنصح بمراقبة متزايدة
es: Paciente anciano - se recomienda monitoreo aumentado

# warning_pediatric_weight
source: Weight outside normal range for age
ar: الوزن خارج النطاق الطبيعي للعمر
es: Peso fuera del rango normal para la edad

# warning_neonatal_maturation
source: Consider organ maturation in dosing
ar: اعتبر نضج الأعضاء في الجرعة
es: Considerar maduración de órganos en la dosificación

# error_required_field
source: This field is required
ar: هذا الحقل مطلوب
es: Este campo es obligatorio

# error_invalid_age
source: Please enter a valid age
ar: يرجى إدخال عمر صحيح
es: Por favor ingrese una edad válida

# error_invalid_weight
source: Please enter a valid weight
ar: يرجى إدخال وزن صحيح
es: Por favor ingrese un peso válido

# error_invalid_height
source: Please enter a valid height
ar: يرجى إدخال طول صحيح
es: Por favor ingrese una altura válida

# error_invalid_creatinine
source: Please enter a valid creatinine value
ar: يرجى إدخال قيمة كرياتينين صحيحة
es: Por favor ingrese un valor de creatinina válido

# error_age_range
source: Age must be between %@ and %@
ar: يجب أن يكون العمر بين %@ و %@
es: La edad debe estar entre %@ y %@

# error_weight_range
source: Weight must be between %@ and %@
ar: يجب أن يكون الوزن بين %@ و %@
es: El peso debe estar entre %@ y %@

# error_height_range
source: Height must be between %@ and %@
ar: يجب أن يكون الطول بين %@ و %@
es: La altura debe estar entre %@ y %@

# error_creatinine_range
source: Creatinine must be between %@ and %@
ar: يجب أن يكون الكرياتينين بين %@ و %@
es: La creatinina debe estar entre %@ y %@

# unit_years
source: years
ar: سنوات
es: años

# unit_months
source: months
ar: أشهر
es: meses

# unit_weeks
source: weeks
ar: أسابيع
es: semanas

# unit_days
source: days
ar: أيام
es: días

# unit_kg
source: kg
ar: كغ

# unit_lbs
source: lbs
ar: رطل

# unit_cm
source: cm
ar: سم

# unit_inches
source: inches
ar: بوصة
es: pulgadas

# unit_mg_dl
source: mg/dL
ar: مغ/دل

# unit_umol_l
source: μmol/L
ar: μمول/ل

# unit_mg
source: mg
ar: مغ

# unit_mg_kg
source: mg/kg
ar: مغ/كغ

# unit_hours
source: hours
ar: ساعات
es: horas

# unit_ml_min
source: mL/min
ar: مل/دقيقة

# unit_l_h
source: L/h
ar: ل/ساعة

# unit_l
source: L
ar: ل

# unit_mg_l
source: mg/L
ar: مغ/ل

# unit_mg_h_l
source: mg·h/L
ar: مغ·ساعة/ل

source: Settings
ar: الإعدادات
es: Configuración

source: Preferences
ar: التفضيلات
es: Preferencias

source: Language
ar: اللغة
es: Idioma

source: Appearance
ar: المظهر
es: Apariencia

source: Units
ar: الوحدات
es: Unidades

source: Clinical Preferences
ar: التفضيلات السريرية
es: Preferencias Clínicas

source: Default Population
ar: السكان الافتراضي
es: Población Predeterminada

source: Default CrCl Method
ar: طريقة CrCl الافتراضية
es: Método CrCl Predeterminado

source: Show Clinical Warnings
ar: إظهار التحذيرات السريرية
es: Mostrar Advertencias Clínicas

source: Auto-save Calculations
ar: حفظ الحسابات تلقائياً
es: Guardar Cálculos Automáticamente

source: Privacy & Analytics
ar: الخصوصية والتحليلات
es: Privacidad y Análisis

source: Usage Analytics
ar: تحليلات الاستخدام
es: Análisis de Uso

source: Crash Reporting
ar: تقرير الأعطال
es: Reporte de Fallos

# export_data
source: Export My Data
ar: تصدير بياناتي
es: Exportar Mis Datos

source: Delete All Data
ar: حذف جميع البيانات
es: Eliminar Todos los Datos

source: Accessibility
ar: إمكانية الوصول
es: Accesibilidad

source: Enhanced VoiceOver
ar: VoiceOver محسن
es: VoiceOver Mejorado

# high_contrast
source: High Contrast Mode
ar: وضع التباين العالي
es: Modo de Alto Contraste

source: Reduce Motion
ar: تقليل الحركة
es: Reducir Movimiento

source: Text Size
ar: حجم النص
es: Tamaño del Texto

source: Privacy Policy
ar: سياسة الخصوصية
es: Política de Privacidad

source: Terms of Use
ar: شروط الاستخدام
es: Términos de Uso

# eula_title
source: End User License Agreement
ar: اتفاقية ترخيص المستخدم النهائي
es: Acuerdo de Licencia de Usuario Final

# eula_accept
source: I Accept
ar: أوافق
es: Acepto

# eula_decline
source: Decline
ar: رفض
es: Rechazar

source: Medical Disclaimer
ar: إخلاء المسؤولية الطبية
es: Descargo de Responsabilidad Médica

source: Help & Tutorial
ar: المساعدة والدليل
es: Ayuda y Tutorial

source: Contact Support
ar: اتصل بالدعم
es: Contactar Soporte

# rate_app
source: Rate Vancomyzer
ar: قيم فانكومايزر
es: Calificar Vancomyzer

# share_app
source: Share Vancomyzer
ar: شارك فانكومايزر
es: Compartir Vancomyzer

source: Open Source Licenses
ar: تراخيص المصدر المفتوح
es: Licencias de Código Abierto

source: About Vancomyzer
ar: حول فانكومايزر
es: Acerca de Vancomyzer

source: Version
ar: الإصدار
es: Versión

source: Build
ar: البناء
es: Compilación

source: Last Updated
ar: آخر تحديث
es: Última Actualización

source: Development Team
ar: فريق التطوير
es: Equipo de Desarrollo

source: Clinical References
ar: المراجع السريرية
es: Referencias Clínicas

source: Credits
ar: الاعتمادات
es: Créditos

source: Calculate
ar: احسب
es: Calcular

source: Calculate Dosing
ar: احسب الجرعة
es: Calcular Dosificación

source: Recalculate
ar: أعد الحساب
es: Recalcular

source: Reset
ar: إعادة تعيين
es: Restablecer

source: Save
ar: حفظ
es: Guardar

source: Cancel
ar: إلغاء
es: Cancelar

source: Done
ar: تم
es: Hecho

source: Close
ar: إغلاق
es: Cerrar

source: Edit
ar: تحرير
es: Editar

source: Delete
ar: حذف
es: Eliminar

source: Export
ar: تصدير
es: Exportar

source: Share
ar: مشاركة
es: Compartir

source: Copy
ar: نسخ
es: Copiar

# retry
source: Try Again
ar: حاول مرة أخرى
es: Intentar de Nuevo

source: Continue
ar: متابعة
es: Continuar

source: Back
ar: رجوع
es: Atrás

source: Next
ar: التالي
es: Siguiente

source: Skip
ar: تخطي
es: Omitir

source: Learn More
ar: تعلم المزيد
es: Aprender Más

source: Calculating...
ar: جاري الحساب...
es: Calculando...

source: Optimizing...
ar: جاري التحسين...
es: Optimizando...

source: Loading...
ar: جاري التحميل...
es: Cargando...

source: Saving...
ar: جاري الحفظ...
es: Guardando...

source: Exporting...
ar: جاري التصدير...
es: Exportando...

source: Calculation Complete
ar: اكتمل الحساب
es: Cálculo Completo

source: Optimization Complete
ar: اكتمل التحسين
es: Optimización Completa

source: Data Saved
ar: تم حفظ البيانات
es: Datos Guardados

source: Data Exported
ar: تم تصدير البيانات
es: Datos Exportados

source: Copied to Clipboard
ar: تم النسخ إلى الحافظة
es: Copiado al Portapapeles

# error_calculation_failed
source: Calculation Failed
ar: فشل الحساب
es: Falló el Cálculo

# error_optimization_failed
source: Optimization Failed
ar: فشل التحسين
es: Falló la Optimización

# error_network_unavailable
source: Network Unavailable
ar: الشبكة غير متاحة
es: Red No Disponible

# error_data_corrupted
source: Data Corrupted
ar: البيانات تالفة
es: Datos Corruptos

# error_export_failed
source: Export Failed
ar: فشل التصدير
es: Falló la Exportación

# error_generic
source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.
es: Ocurrió un error. Por favor intente de nuevo.

# guidelines_adult
source: Adult Guidelines
ar: إرشادات البالغين
es: Guías para Adultos

# guidelines_pediatric
source: Pediatric Guidelines
ar: إرشادات الأطفال
es: Guías Pediátricas

# guidelines_neonatal
source: Neonatal Guidelines
ar: إرشادات حديثي الولادة
es: Guías Neonatales

# guidelines_monitoring
source: Monitoring Guidelines
ar: إرشادات المراقبة
es: Guías de Monitoreo

# guidelines_safety
source: Safety Guidelines
ar: إرشادات السلامة
es: Guías de Seguridad

source: Calculation History
ar: تاريخ الحسابات
es: Historial de Cálculos

source: No Calculations
ar: لا توجد حسابات
es: Sin Cálculos

# no_calculations_message
source: Your calculation history will appear here
ar: سيظهر تاريخ حساباتك هنا
es: Su historial de cálculos aparecerá aquí

source: Clear History
ar: مسح التاريخ
es: Limpiar Historial

source: Export History
ar: تصدير التاريخ
es: Exportar Historial

# accessibility_age_input
source: Enter patient age
ar: أدخل عمر المريض
es: Ingresar edad del paciente

# accessibility_weight_input
source: Enter patient weight
ar: أدخل وزن المريض
es: Ingresar peso del paciente

# accessibility_height_input
source: Enter patient height
ar: أدخل طول المريض
es: Ingresar altura del paciente

# accessibility_creatinine_input
source: Enter serum creatinine
ar: أدخل الكرياتينين في المصل
es: Ingresar creatinina sérica

# accessibility_calculate_button
source: Calculate vancomycin dosing
ar: احسب جرعة الفانكومايسين
es: Calcular dosificación de vancomicina

# accessibility_population_picker
source: Select patient population
ar: اختر سكان المريض
es: Seleccionar población del paciente

# accessibility_gender_picker
source: Select patient gender
ar: اختر جنس المريض
es: Seleccionar género del paciente

# accessibility_indication_picker
source: Select infection indication
ar: اختر مؤشر العدوى
es: Seleccionar indicación de infección

# accessibility_severity_picker
source: Select infection severity
ar: اختر شدة العدوى
es: Seleccionar severidad de infección

# accessibility_hint_required
source: This field is required
ar: هذا الحقل مطلوب
es: Este campo es obligatorio

# accessibility_hint_optional
source: This field is optional
ar: هذا الحقل اختياري
es: Este campo es opcional

# accessibility_hint_calculation
source: Tap to calculate dosing recommendation
ar: اضغط لحساب توصية الجرعة
es: Toque para calcular recomendación de dosificación

# accessibility_hint_navigation
source: Navigate to %@
ar: انتقل إلى %@
es: Navegar a %@

# clinical_note_auc_targeting
source: AUC₀₋₂₄ targeting is recommended over trough-based dosing
ar: يُنصح بهدف AUC₀₋₂₄ على الجرعة المبنية على القاع
es: Se recomienda el objetivo AUC₀₋₂₄ sobre la dosificación basada en valle

# clinical_note_loading_dose
source: Loading dose recommended for severe infections
ar: جرعة التحميل مُنصح بها للعدوى الشديدة
es: Dosis de carga recomendada para infecciones severas

# clinical_note_renal_adjustment
source: Dose adjustment required for renal impairment
ar: تعديل الجرعة مطلوب لضعف الكلى
es: Se requiere ajuste de dosis por deterioro renal

# clinical_note_pediatric_weight
source: Weight-based dosing for pediatric patients
ar: جرعة مبنية على الوزن للمرضى الأطفال
es: Dosificación basada en peso para pacientes pediátricos

# clinical_note_neonatal_maturation
source: Consider organ maturation in neonatal dosing
ar: اعتبر نضج الأعضاء في جرعة حديثي الولادة
es: Considerar maduración de órganos en dosificación neonatal

# tutorial_welcome
source: Welcome to Vancomyzer Tutorial
ar: مرحباً بك في دليل فانكومايزر
es: Bienvenido al Tutorial de Vancomyzer

# tutorial_patient_input
source: Patient Information Entry
ar: إدخال معلومات المريض
es: Entrada de Información del Paciente

# tutorial_calculation
source: Dosing Calculation
ar: حساب الجرعة
es: Cálculo de Dosificación

# tutorial_bayesian
source: Bayesian Optimization
ar: التحسين البايزي
es: Optimización Bayesiana

# tutorial_results
source: Understanding Results
ar: فهم النتائج
es: Entendiendo los Resultados

# tutorial_monitoring
source: Monitoring Guidelines
ar: إرشادات المراقبة
es: Guías de Monitoreo

source: Tutorial Complete
ar: اكتمل الدليل
es: Tutorial Completo

# feature_evidence_based
source: Evidence-Based Algorithms
ar: خوارزميات مبنية على الأدلة
es: Algoritmos Basados en Evidencia

# feature_evidence_based_desc
source: Built on ASHP/IDSA 2020 guidelines for optimal patient outcomes
ar: مبني على إرشادات ASHP/IDSA 2020 لنتائج مثلى للمريض
es: Construido sobre las guías ASHP/IDSA 2020 para resultados óptimos del paciente

# feature_bayesian
source: Bayesian Optimization
ar: التحسين البايزي
es: Optimización Bayesiana

# feature_bayesian_desc
source: Personalized dosing using patient-specific pharmacokinetic parameters
ar: جرعة شخصية باستخدام معاملات دوائية حركية خاصة بالمريض
es: Dosificación personalizada usando parámetros farmacocinéticos específicos del paciente

# feature_multi_population
source: Multi-Population Support
ar: دعم متعدد السكان
es: Soporte Multi-Población

# feature_multi_population_desc
source: Specialized algorithms for adult, pediatric, and neonatal patients
ar: خوارزميات متخصصة للمرضى البالغين والأطفال وحديثي الولادة
es: Algoritmos especializados para pacientes adultos, pediátricos y neonatales

# feature_auc_targeting
source: AUC₀₋₂₄ Targeting
ar: هدف AUC₀₋₂₄
es: Objetivo AUC₀₋₂₄

# feature_auc_targeting_desc
source: Modern AUC-guided dosing for improved efficacy and safety
ar: جرعة حديثة موجهة بـ AUC لتحسين الفعالية والسلامة
es: Dosificación moderna guiada por AUC para mejorar eficacia y seguridad

# feature_clinical_validation
source: Clinical Validation
ar: التحقق السريري
es: Validación Clínica

# feature_clinical_validation_desc
source: Real-time safety checks and clinical plausibility validation
ar: فحوصات سلامة في الوقت الفعلي وتحقق من المعقولية السريرية
es: Verificaciones de seguridad en tiempo real y validación de plausibilidad clínica

# feature_privacy
source: Privacy-First Design
ar: تصميم يركز على الخصوصية
es: Diseño Centrado en Privacidad

# feature_privacy_desc
source: All patient data remains secure on your device
ar: جميع بيانات المريض تبقى آمنة على جهازك
es: Todos los datos del paciente permanecen seguros en su dispositivo

# confirm_delete_calculation
source: Delete this calculation?
ar: حذف هذا الحساب؟
es: ¿Eliminar este cálculo?

# confirm_clear_history
source: Clear all calculation history?
ar: مسح جميع تاريخ الحسابات؟
es: ¿Limpiar todo el historial de cálculos?

# confirm_delete_all_data
source: Delete all app data? This cannot be undone.
ar: حذف جميع بيانات التطبيق؟ لا يمكن التراجع عن هذا.
es: ¿Eliminar todos los datos de la aplicación? Esto no se puede deshacer.

# confirm_reset_settings
source: Reset all settings to defaults?
ar: إعادة تعيين جميع الإعدادات للافتراضية؟
es: ¿Restablecer todas las configuraciones a los valores predeterminados?

# success_calculation_saved
source: Calculation saved successfully
ar: تم حفظ الحساب بنجاح
es: Cálculo guardado exitosamente

# success_data_exported
source: Data exported successfully
ar: تم تصدير البيانات بنجاح
es: Datos exportados exitosamente

# success_settings_saved
source: Settings saved successfully
ar: تم حفظ الإعدادات بنجاح
es: Configuración guardada exitosamente

# success_feedback_sent
source: Feedback sent successfully
ar: تم إرسال التعليقات بنجاح
es: Comentarios enviados exitosamente
